
tap 'buo/cask-upgrade'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

cask_args appdir: '/Applications'

brew 'ag'
brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'buf'
brew 'curl'
brew 'duf'
brew 'dust'
brew 'eza'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'go'
brew 'gping'
brew 'gnu-sed'
brew 'htop'
brew 'ipcalc'
brew 'jq'
brew 'lnav'
brew 'lux'
brew 'make'
brew 'mas'
brew 'neofetch'
brew 'neovim'
brew 'node'
brew 'openssh'
brew 'openssl'
brew 'procs'
brew 'protobuf'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'ripgrep'
brew 'rustup'
brew 'sd'
brew 'starship'
brew 'tldr'
brew 'tmux'
brew 'xh'

cask '1password'
cask 'alacritty'
cask 'arc'
cask 'cleanmymac'
cask 'discord'
cask 'docker'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-open-sans'
cask 'goland'
cask 'google-drive'
cask 'insomnia'
cask 'iterm2'
cask 'keka'
cask 'mpv'
cask 'obsidian'
cask 'raycast'
cask 'shottr'
cask 'tomighty'
cask 'transmission'
cask 'whatsapp'

mas 'Amphetamine', id: 937984704
mas 'iA Writer', id: 775737590
mas 'Kindle', id: 302584613
